dwld/index.org
#+OPTIONS:    toc:2 author:nil creator:nil
#+STARTUP:    align
#+TITLE:      KrISS dwld
#+AUTHOR:     Tontof
#+LANGUAGE:   en
#+STYLE:      <style type="text/css"></style>
#+LINK_UP:    ..
#+LINK_HOME:  ..
#+EXPORT_EXCLUDE_TAGS: noexport
#+STYLE: <link rel="stylesheet" type="text/css" href="../inc/style.css" />

KrISS dwld is a simple and smart (or stupid) downloader bookmarklet.

Feel free to contribute: https://github.com/tontof/kriss_dwld

* KrISS dwld bookmarklet
  :PROPERTIES:
  :CUSTOM_ID: KrISS_dwld
  :END:
#+HTML:<div id="instructions">Drag the browser button link into your Bookmarks Toolbar:</div>
#+HTML:<a onclick="alert(document.getElementById('instructions').firstChild.nodeValue);return false;" href="javascript:(function(){var e=document.createElement('script');e.src='//tontof.net/kriss/dwld/script.js';document.body.appendChild(e);})();">KrISS dwld</a>

This bookmarklet loads the script located at
http://tontof.net/kriss/dwld/script.js

It is based on 2 Grease Monkey scripts :
- http://userscripts.org/scripts/review/25105 (Licence MIT) for
  Youtube
- http://userscripts.org/scripts/review/130917 (GPL3) for other
  websites (Dailymotion, Vimeo, Veoh, etc.)

This bookmarklet is very convenient because you do not need to install
extension as GreaseMonkey or program and you will always be
up-to-date. However KrISS dwld rely on http://tontof.net but it's up
to you. You can use following bookmarklets to be totally free of
external service!

* Standalone bookmarklets
Following bookmarklet(s) do not rely on http://tontof.net so they will
not be update automatically.
** Youtube
  :PROPERTIES:
  :CUSTOM_ID: youtube
  :END:
#+HTML:<a onclick="alert(document.getElementById('instructions').firstChild.nodeValue);return false;" href="javascript:(function(){'use%20strict';function%20Rk(a){a=a.split(%22%22);a=a.reverse();a=a.slice(1);a=Sk(a,1);a=a.reverse();a=Sk(a,43);a=a.reverse();a=a.slice(1);a=a.reverse();return%20a.join(%22%22)}function%20Sk(a,b){var%20c=a[0];a[0]=a[b%25a.length];a[b]=c;return%20a};function%20ytSig(d){return%20Rk(d);}if(window.location.href.indexOf('/embed/')!==-1){window.location.assign(window.location.href.replace('/embed/','/watch%3Fv='));}else{var%20i=0,FORMAT_LABEL={'5':'FLV%20240p','18':'MP4%20360p','22':'MP4%20720p%20(HD)','34':'FLV%20360p','35':'FLV%20480p','37':'MP4%201080p%20(HD)','38':'MP4%204K%20(HD)','43':'WebM%20360p','44':'WebM%20480p','45':'WebM%20720p%20(HD)','46':'WebM%201080p%20(HD)'},player=document.getElementById('movie_player')||document.getElementById('movie_player-flash'),tab=[],videoFormats,vars={};if(player){tab=player.getAttribute('flashvars').split('%26');for(i=0;i%20%3C%20tab.length;i++){vars[tab[i].split('=')[0]]=tab[i].split('=')[1];}videoFormats=decodeURIComponent(vars.url_encoded_fmt_stream_map);}else{if(typeof(yt)!='undefined'%20%26%26%20yt.playerConfig){videoFormats=yt.playerConfig.args.url_encoded_fmt_stream_map;}else{return;}}var%20videoURL={};var%20videoFormatsGroup=videoFormats.split(',');for(i=0;i%3CvideoFormatsGroup.length;i++){var%20videoFormatsElem=videoFormatsGroup[i].split('%26');var%20videoFormatsPair={};for(var%20j=0;j%3CvideoFormatsElem.length;j++){var%20pair=videoFormatsElem[j].split('=');if(pair.length===2){videoFormatsPair[pair[0]]=pair[1];}}var%20url=(videoFormatsPair.url)%3FvideoFormatsPair.url:null;if(url===null){continue;}var%20itag=(videoFormatsPair.itag)%3FvideoFormatsPair.itag:null;if(itag===null){continue;}var%20signature=(videoFormatsPair.sig)%3FvideoFormatsPair.sig:null;if(signature==null){signature=ytSig(videoFormatsPair.s);}if(signature!==null){videoFormatsPair.url=decodeURIComponent(url)+'%26signature='+signature;}videoFormatsPair.type=decodeURIComponent(videoFormatsPair.type);if(url.toLowerCase().indexOf('http')===0){videoURL[itag]=videoFormatsPair;}}var%20s='';var%20list=[];for(var%20type%20in%20videoURL){if(FORMAT_LABEL[type]){list.push(type);s+=list.length+'%20=%3E%20'+FORMAT_LABEL[type]+'\n';}}var%20r=parseInt(window.prompt(s),10)-1;if(r%20%3C%20list.length){window.location.assign(videoURL[list[r]].url);}}})();">Youtube</a>
* Alternatives
** Youtube-dl
Command line using python:
- http://rg3.github.io/youtube-dl/
** KeepVid
Needs java but also works with a bookmarklet:
- http://www.keepvid.com
** PwnYoutube / deturl
Add pwn in from of url
http://www.youtube.com/XXXXX
by
http://pwnyoutube.com/XXXXX 
or go to
http://deturl.com
