dwld/index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>KrISS dwld</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="KrISS dwld"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-10 15:20:54 CET"/>
<meta name="author" content="Tontof"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../inc/style.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href=".."> UP </a>
 |
 <a accesskey="H" href=".."> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">KrISS dwld</h1>

<p>KrISS dwld is a simple and smart (or stupid) downloader bookmarklet.
</p>
<p>
Feel free to contribute: <a href="https://github.com/tontof/kriss_dwld">https://github.com/tontof/kriss_dwld</a>
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#KrISS_dwld">1 KrISS dwld bookmarklet</a></li>
<li><a href="#sec-2">2 Standalone bookmarklets</a>
<ul>
<li><a href="#youtube">2.1 Youtube</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Alternatives</a>
<ul>
<li><a href="#sec-3-1">3.1 Youtube-dl</a></li>
<li><a href="#sec-3-2">3.2 KeepVid</a></li>
<li><a href="#sec-3-3">3.3 PwnYoutube / deturl</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-KrISS_dwld" class="outline-2">
<h2 id="KrISS_dwld"><a name="sec-1" id="sec-1"></a><span class="section-number-2">1</span> KrISS dwld bookmarklet</h2>
<div class="outline-text-2" id="text-KrISS_dwld">


<div id="instructions">Drag the browser button link into your Bookmarks Toolbar:</div>
<a onclick="alert(document.getElementById('instructions').firstChild.nodeValue);return false;" href="javascript:(function(){var e=document.createElement('script');e.src='//tontof.net/kriss/dwld/script.js';document.body.appendChild(e);})();">KrISS dwld</a>

<p>
This bookmarklet loads the script located at
<a href="http://tontof.net/kriss/dwld/script.js">http://tontof.net/kriss/dwld/script.js</a>
</p>
<p>
It is based on 2 Grease Monkey scripts :
</p><ul>
<li><a href="http://userscripts.org/scripts/review/25105">http://userscripts.org/scripts/review/25105</a> (Licence MIT) for
  Youtube
</li>
<li><a href="http://userscripts.org/scripts/review/130917">http://userscripts.org/scripts/review/130917</a> (GPL3) for other
  websites (Dailymotion, Vimeo, Veoh, etc.)
</li>
</ul>


<p>
This bookmarklet is very convenient because you do not need to install
extension as GreaseMonkey or program and you will always be
up-to-date. However KrISS dwld rely on <a href="http://tontof.net">http://tontof.net</a> but it's up
to you. You can use following bookmarklets to be totally free of
external service!
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Standalone bookmarklets</h2>
<div class="outline-text-2" id="text-2">

<p>Following bookmarklet(s) do not rely on <a href="http://tontof.net">http://tontof.net</a> so they will
not be update automatically.
</p>
</div>

<div id="outline-container-youtube" class="outline-3">
<h3 id="youtube"><a name="sec-2-1" id="sec-2-1"></a><span class="section-number-3">2.1</span> Youtube</h3>
<div class="outline-text-3" id="text-youtube">


<a onclick="alert(document.getElementById('instructions').firstChild.nodeValue);return false;" href="javascript:(function(){'use%20strict';function%20Rk(a){a=a.split(%22%22);a=a.reverse();a=a.slice(1);a=Sk(a,1);a=a.reverse();a=Sk(a,43);a=a.reverse();a=a.slice(1);a=a.reverse();return%20a.join(%22%22)}function%20Sk(a,b){var%20c=a[0];a[0]=a[b%25a.length];a[b]=c;return%20a};function%20ytSig(d){return%20Rk(d);}if(window.location.href.indexOf('/embed/')!==-1){window.location.assign(window.location.href.replace('/embed/','/watch%3Fv='));}else{var%20i=0,FORMAT_LABEL={'5':'FLV%20240p','18':'MP4%20360p','22':'MP4%20720p%20(HD)','34':'FLV%20360p','35':'FLV%20480p','37':'MP4%201080p%20(HD)','38':'MP4%204K%20(HD)','43':'WebM%20360p','44':'WebM%20480p','45':'WebM%20720p%20(HD)','46':'WebM%201080p%20(HD)'},player=document.getElementById('movie_player')||document.getElementById('movie_player-flash'),tab=[],videoFormats,vars={};if(player){tab=player.getAttribute('flashvars').split('%26');for(i=0;i%20%3C%20tab.length;i++){vars[tab[i].split('=')[0]]=tab[i].split('=')[1];}videoFormats=decodeURIComponent(vars.url_encoded_fmt_stream_map);}else{if(typeof(yt)!='undefined'%20%26%26%20yt.playerConfig){videoFormats=yt.playerConfig.args.url_encoded_fmt_stream_map;}else{return;}}var%20videoURL={};var%20videoFormatsGroup=videoFormats.split(',');for(i=0;i%3CvideoFormatsGroup.length;i++){var%20videoFormatsElem=videoFormatsGroup[i].split('%26');var%20videoFormatsPair={};for(var%20j=0;j%3CvideoFormatsElem.length;j++){var%20pair=videoFormatsElem[j].split('=');if(pair.length===2){videoFormatsPair[pair[0]]=pair[1];}}var%20url=(videoFormatsPair.url)%3FvideoFormatsPair.url:null;if(url===null){continue;}var%20itag=(videoFormatsPair.itag)%3FvideoFormatsPair.itag:null;if(itag===null){continue;}var%20signature=(videoFormatsPair.sig)%3FvideoFormatsPair.sig:null;if(signature==null){signature=ytSig(videoFormatsPair.s);}if(signature!==null){videoFormatsPair.url=decodeURIComponent(url)+'%26signature='+signature;}videoFormatsPair.type=decodeURIComponent(videoFormatsPair.type);if(url.toLowerCase().indexOf('http')===0){videoURL[itag]=videoFormatsPair;}}var%20s='';var%20list=[];for(var%20type%20in%20videoURL){if(FORMAT_LABEL[type]){list.push(type);s+=list.length+'%20=%3E%20'+FORMAT_LABEL[type]+'\n';}}var%20r=parseInt(window.prompt(s),10)-1;if(r%20%3C%20list.length){window.location.assign(videoURL[list[r]].url);}}})();">Youtube</a>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Alternatives</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Youtube-dl</h3>
<div class="outline-text-3" id="text-3-1">

<p>Command line using python:
</p><ul>
<li><a href="http://rg3.github.io/youtube-dl/">http://rg3.github.io/youtube-dl/</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> KeepVid</h3>
<div class="outline-text-3" id="text-3-2">

<p>Needs java but also works with a bookmarklet:
</p><ul>
<li><a href="http://www.keepvid.com">http://www.keepvid.com</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> PwnYoutube / deturl</h3>
<div class="outline-text-3" id="text-3-3">

<p>Add pwn in from of url
<a href="http://www.youtube.com/XXXXX">http://www.youtube.com/XXXXX</a>
by
<a href="http://pwnyoutube.com/XXXXX">http://pwnyoutube.com/XXXXX</a> 
or go to
<a href="http://deturl.com">http://deturl.com</a>
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-01-10 15:20:54 CET</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
